#На вход программе подается строка текста. Напишите программу, которая определяет количество различных символов в строке.

string_set = (input())
print(len(string_set))