# Код Морзе для представления цифр и букв использует тире и точки.

# Напишите программу для кодирования текстового сообщения в соответствии с кодом Морзе.
# Символ 	Код 	Символ 	Код 	Символ 	Код 	Символ 	Код
# A 	.- 	J 	.--- 	S 	... 	1 	.----
# B 	-... 	K 	-.- 	T 	- 	2 	..---
# C 	-.-. 	L 	.-.. 	U 	..- 	3 	...--
# D 	-.. 	M 	-- 	V 	...- 	4 	....-
# E 	. 	N 	-. 	W 	.-- 	5 	.....
# F 	..-. 	O 	--- 	X 	-..- 	6 	-....
# G 	--. 	P 	.--. 	Y 	-.-- 	7 	--...
# H 	.... 	Q 	--.- 	Z 	--.. 	8 	---..
# I 	.. 	R 	.-. 	0 	----- 	9 	----.

alth = 'QWERTYUIOPLKJHGFDSAZXCVBNM0123456789'
dct_morze = {
    "A": ".-",
    "J": ".---",
    "S": "...",
    "1": ".----",
    "B": "-...",
    "K": "-.-",
    "T": "-",
    "2": "..---",
    "C": "-.-.",
    "L": ".-..",
    "U": "..-",
    "3": "...--",
    "D": "-..",
    "M": "--",
    "V": "...-",
    "4": "....-",
    "E": ".",
    "N": "-.",
    "W": ".--",
    "5": ".....",
    "F": "..-.",
    "O": "---",
    "X": "-..-",
    "6": "-....",
    "G": "--.",
    "P": ".--.",
    "Y": "-.--",
    "7": "--...",
    "H": "....",
    "Q": "--.-",
    "Z": "--..",
    "8": "---..",
    "I": "..",
    "R": ".-.",
    "0": "-----",
    "9": "----.",
}


message = input()
message_morze = ''
for c in message:
    if c.upper() in alth:
        message_morze += dct_morze[c.upper()] + ' '

print(message_morze)        